Repository: kvmy666/gym_club_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Elite Fitness
ar: إيليت فيتنس

# navHome
source: Home
ar: الرئيسية

# navTrack
source: Log workout
ar: سجل التمرين

# navAi
source: AI
ar: الذكاء

# navShop
source: Shop
ar: المتجر

# navSettings
source: Settings
ar: الإعدادات

# homeGreeting
source: Welcome back, {name}!
ar: مرحباً، {name}!

# homeMessage
source: Your personalised plan is ready. Let's crush today's goals.
ar: خطة التدريب المخصصة جاهزة، فلننجز أهداف اليوم.

# dailyStreak
source: {count}-day streak
ar: سلسلة من {count} يوم

# minutesLabel
source: min
ar: د

source: Featured classes
ar: حصص مميزة

source: View all
ar: عرض الكل

# focusWorkoutTitle
source: {category} focus session
ar: جلسة تركيز {category}

# focusWorkoutSubtitle
source: Targeted strength with guided tempo cues and recovery timers.
ar: تمارين قوة موجهة مع إرشادات إيقاع وفترات استشفاء.

# startButton
source: Start
ar: ابدأ

# nextButton
source: Next
ar: التالي

# weeklySummaryTitle
source: Weekly progress
ar: التقدم الأسبوعي

# weeklySummarySubtitle
source: 3 of 4 workouts completed
ar: 3 من أصل 4 تمارين مكتملة

# weekdayShortLabels
source: Mon,Tue,Wed,Thu,Fri,Sat,Sun
ar: الإث,الث,الأر,الخ,الج,الس,الح

# classCoachLabel
source: Coach {coach}
ar: المدرب {coach}

# trackTitle
source: Log workout
ar: سجل التمرين

# trackSubtitle
source: Name your day, pick exercises, and capture every set.
ar: سمّ اليوم التدريبي، واختر التمرين، وسجل كل جلسة.

source: Log workout
ar: سجل التمرين

# workoutNameLabel
source: Workout name
ar: اسم التمرين

# workoutNameHint
source: Add a name to this session
ar: أضف اسماً لهذه الجلسة

# timeLabel
source: Time
ar: الوقت

# timerLabel
source: Timer
ar: المؤقت

# restTimerLabel
source: Rest timer
ar: مؤقت الراحة

# volumeLabel
source: Volume
ar: الحجم

# setsLabel
source: Sets
ar: الجلسات

# setsHeader
source: Sets
ar: الجلسات

source: Add set
ar: أضف جلسة

# noSetsYet
source: No sets yet. Add your first set to begin tracking.
ar: لا توجد جلسات بعد. أضف جلستك الأولى لبدء التتبع.

# weightFieldLabel
source: Weight (kg)
ar: الوزن (كجم)

# invalidWeight
source: Enter a valid weight
ar: أدخل وزناً صحيحاً

# repsFieldLabel
source: Reps
ar: التكرارات

# invalidReps
source: Enter a valid rep count
ar: أدخل عدد تكرارات صالح

source: Cancel
ar: إلغاء

source: Save set
ar: احفظ الجلسة

source: Delete set
ar: حذف الجلسة

# resumeButton
source: Resume
ar: استمرار

# finishButton
source: Finish
ar: إنهاء

# resetButton
source: Reset
ar: إعادة ضبط

# resetSessionButton
source: Reset session
ar: إعادة ضبط الجلسة

# summaryHeader
source: Summary of sets
ar: ملخص الجلسات

# weekTab
source: Week
ar: أسبوع

# monthTab
source: Month
ar: شهر

# yearTab
source: Year
ar: سنة

# weightTrendTitle
source: Trend
ar: الاتجاه

# weightTrendSubtitle
source: Last 7 sessions
ar: آخر 7 قياسات

# logWeightButton
source: Log workout
ar: سجل التمرين

# currentWeight
source: Current
ar: الحالي

# goalWeight
source: Goal {value} kg
ar: الهدف {value} كجم

# aiCoachTitle
source: AI coach
ar: المدرب الذكي

# aiCoachSubtitle
source: Microservice insights tuned to your recovery and goals.
ar: رؤى من الخدمات المصغرة وفق تعافيك وأهدافك.

# aiMicroserviceHint
source: Connected to training, nutrition, and wearable microservices for live adjustments.
ar: مرتبط بخدمات التدريب والتغذية والأجهزة القابلة للارتداء للتعديل الفوري.

# aiCoachInputHint
source: Tell your coach how you feel today...
ar: أخبر المدرب الذكي كيف تشعر اليوم...

# shopTitle
source: Fuel & gear
ar: التغذية والمعدات

# shopSubtitle
source: Curated essentials that match your training plan.
ar: مختارات تناسب خطة تدريبك.

# shopSearchHint
source: Search supplements, apparel, gear...
ar: ابحث عن مكملات أو ملابس أو معدات...

source: Add to cart
ar: أضف إلى السلة

# cartTitle
source: Cart â€¢ {count} items
ar: السلة • {count} منتجات

# cartEmpty
source: Your cart is empty
ar: سلتك فارغة

# cartTotalLabel
source: Total (incl. 15% VAT)
ar: الإجمالي (شامل 15٪ ضريبة)

# cartCheckoutButton
source: Checkout
ar: أكمل الدفع

# cartViewButton
source: View cart
ar: عرض السلة

# personalInfoSection
source: Personal details
ar: البيانات الشخصية

# emailLabel
source: Email
ar: البريد الإلكتروني

# weightLabel
source: Weight
ar: الوزن

# heightLabel
source: Height
ar: الطول

# membershipSection
source: Club membership
ar: عضوية النادي

# membershipRemaining
source: {days} days remaining
ar: متبقي {days} يوم

# membershipPlans
source: Plans
ar: الباقات

# membershipPlanMonthly
source: Monthly
ar: شهري

# membershipPlanQuarterly
source: Quarterly
ar: ربع سنوي

# membershipPlanSemiAnnual
source: Semi-annual
ar: نصف سنوي

# membershipPlanAnnual
source: Annual
ar: سنوي

# supportSection
source: Support
ar: الدعم الفني

# supportEmailLabel
source: Need help? Contact us
ar: للمساعدة تواصل معنا عبر

# settingsTitle
source: Settings
ar: الإعدادات

# settingsSubtitle
source: Fine-tune experience, integrations, and account.
ar: اضبط التجربة والتكاملات والحساب.

# accountSection
source: ACCOUNT
ar: الحساب

# profileTile
source: Profile
ar: الملف الشخصي

# profileTileSubtitle
source: Goals, contact info, and preferences
ar: الأهداف ومعلومات الاتصال والتفضيلات

# notificationsTile
source: Notifications
ar: الإشعارات

# notificationsTileSubtitle
source: Class reminders and streak alerts
ar: تنبيهات الحصص وسلسلة الالتزام

# experienceSection
source: EXPERIENCE
ar: التجربة

# themeTile
source: Theme
ar: الوضع

# themeTileSubtitle
source: Currently {mode}
ar: الوضع الحالي {mode}

# themeSystemLabel
source: System
ar: النظام

# themeLightLabel
source: Light
ar: فاتح

# themeDarkLabel
source: Dark
ar: داكن

# languageTile
source: Language
ar: اللغة

# languageSystemLabel
source: Match system
ar: مطابقة النظام

# integrationsSection
source: INTEGRATIONS
ar: التكاملات

# healthSyncTile
source: Health platforms
ar: منصات الصحة

# supportTile
source: Support
ar: الدعم

# supportSubtitle
source: Chat with the team
ar: تواصل مع الفريق

# logoutButton
source: Log out
ar: تسجيل الخروج

# profileTitle
source: Profile
ar: الملف الشخصي

# profileGoalLabel
source: Goal: {goal}
ar: الهدف: {goal}

# membershipStatusLabel
source: Membership: {tier}
ar: العضوية: {tier}

# metricsSection
source: Metrics
ar: المؤشرات

# metricWorkouts
source: Workouts
ar: التمارين

# metricMinutes
source: Minutes
ar: الدقائق

# metricCalories
source: Calories
ar: السعرات

# preferencesSection
source: Preferences
ar: التفضيلات

# goalTile
source: Training goal
ar: هدف التدريب

# scheduleTile
source: Schedule
ar: الجدول

# scheduleTileSubtitle
source: Monday, Tuesday, Thursday, Saturday
ar: الاثنين، الثلاثاء، الخميس، السبت

# nutritionTile
source: Nutrition
ar: التغذية

# securitySection
source: Security
ar: الأمان

# passwordTile
source: Password
ar: كلمة المرور

# passwordTileSubtitle
source: Last updated 32 days ago
ar: آخر تحديث منذ ٣٢ يوماً

# devicesTile
source: Devices
ar: الأجهزة

# devicesTileSubtitle
source: 2 devices connected
ar: جهازان متصلان

# classesTitle
source: Classes
ar: الحصص

source: Class not found
ar: الحصة غير موجودة

# classOverviewHeadline
source: What to expect
ar: لمحة عن الحصة

# classOverviewBody
source: Progressive pacing with tempo finishers, mobility cooldown, and heart rate coaching.
ar: إيقاع تدريجي مع إنهاءات إيقاعية وتمارين مرونة وتوجيه لمعدل نبض القلب.

# capacityLabel
source: Capacity
ar: السعة

# intensityLabel
source: Intensity
ar: الشدة

# spotsLabel
source: spots
ar: مقعد

# bookClassButton
source: Book class
ar: احجز الحصة

# joinWaitlistButton
source: Join waitlist
ar: انضم لقائمة الانتظار

# skipButton
source: Skip
ar: تخطي

# onboardingTitle1
source: Design your perfect routine
ar: صمم روتينك المثالي

# onboardingSubtitle1
source: Personalised programming built from your goals, equipment, and availability.
ar: برمجة مخصصة حسب أهدافك ومعداتك ووقتك.

# onboardingTitle2
source: Track every rep and recovery
ar: تابع كل تكرار وتعافٍ

# onboardingSubtitle2
source: Integrate wearables, monitor fatigue, and adjust your load instantly.
ar: تكامل مع الأجهزة، راقب الإجهاد، وعدل الحمل فوراً.

# onboardingTitle3
source: AI microservices on standby
ar: خدمات ذكية جاهزة

# onboardingSubtitle3
source: Smart assistants coordinate nutrition, training, and community challenges in real time.
ar: مساعدات ذكية تنسق التغذية والتدريب والتحديات في الوقت الحقيقي.

# calcTitle
source: Calorie calculator
ar: حاسبة السعرات الحرارية

# calcAgeLabel
source: Age
ar: العمر

# calcAgeSuffix
source: yrs
ar: سنة

# calcHeightLabel
source: Height
ar: الطول

# calcHeightSuffix
source: cm
ar: سم

# calcWeightLabel
source: Current weight
ar: الوزن الحالي

# calcWeightSuffix
source: kg
ar: كجم

# calcTargetWeightLabel
source: Target weight
ar: الوزن المستهدف

# calcGenderMale
source: Male
ar: ذكر

# calcGenderFemale
source: Female
ar: أنثى

# calcActivityLabel
source: Activity level
ar: مستوى النشاط

# calcActivitySedentary
source: Sedentary (office job)
ar: خامل (عمل مكتبي)

# calcActivityLight
source: Light (1-3 days/week)
ar: خفيف (١-٣ أيام/أسبوع)

# calcActivityModerate
source: Moderate (3-5 days/week)
ar: متوسط (٣-٥ أيام/أسبوع)

# calcActivityActive
source: Active (6-7 days/week)
ar: نشط (٦-٧ أيام/أسبوع)

# calcActivityVeryActive
source: Very active (athlete)
ar: نشط جداً (رياضي)

# calcGoalLabel
source: Your goal
ar: هدفك

# calcGoalLose
source: Lose weight
ar: خفض الوزن

# calcGoalMaintain
source: Maintain weight
ar: حافظ على الوزن

# calcGoalGain
source: Gain weight
ar: زيادة الوزن

# calcResultTitle
source: Daily intake suggestion
ar: المدخول اليومي المقترح

# calcResultUnit
source: kcal
ar: سعرة

# calcTimeEstimate
source: Estimated time to goal: {weeks} weeks
ar: المدة التقريبية للهدف: {weeks} أسابيع

# addExerciseButton
source: Choose exercise
ar: اختر التمرين

# exercisePickerTitle
source: Select exercise
ar: اختر التمرين

# exerciseSearchHint
source: Search exercises
ar: ابحث عن تمرين

# exerciseCategoryAll
source: All
ar: الكل

# exerciseCategoryBack
source: Back
ar: الظهر

# exerciseCategoryChest
source: Chest
ar: الصدر

# exerciseCategoryLegs
source: Legs
ar: الأرجل

# exerciseCategoryShoulders
source: Shoulders
ar: الأكتاف

# exerciseCategoryCore
source: Abs & core
ar: البطن والوسط

# noExercisesYet
source: No exercises yet. Add your first exercise to begin.
ar: لا توجد تمارين بعد. أضف التمرين الأول للبدء.

# deleteExercise
source: Remove exercise
ar: حذف التمرين

# exerciseSessionsLabel
source: {count} sets
ar: {count} جلسات

# profileSaveButton
source: Save details
ar: حفظ البيانات

# profileSavedMessage
source: Profile updated successfully.
ar: تم تحديث الملف الشخصي بنجاح.

# membershipComparisonTitle
source: Compare plans
ar: مقارنة الباقات

# membershipRenewButton
source: Renew membership
ar: تجديد العضوية

# membershipRenewSuccess
source: Membership renewed for {plan}.
ar: تم تجديد العضوية لمدة {plan}.
